app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
---
SELECT "profiles".* FROM "profiles"

  def create
    @profile = Profile.new(profile_params)
    # creating an empty instance and fill it with details
    @profile.user = current_user

    # sending back a response from the person who used the form
    respond_to do |format|
      # save profile
      if @profile.save
---
INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2017-09-15 04:58:54.675526"], ["updated_at", "2017-09-15 04:58:54.675526"]]

  def update
    respond_to do |format|
      # save profile
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "avatar" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["avatar", "https://media.licdn.com/mpr/mpr/shrinknp_200_200/AAEAAQAAAAAAAAyCAAAAJGQ5NmE1YjJkLTNjYzQtNGY5Zi1iZTVmLWE1YWVjZTlmYzUzZA.jpg"], ["updated_at", "2017-09-15 04:39:34.943222"], ["id", 1]]

  def destroy
    respond_to do |format|
      if @profile.destroy
---
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 1]]

  def set_profile
    @profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]